Revit 2027 API
FormattedText.GetListType Method
 Returns the ListType of a paragraph.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ListType GetListType(
	TextRange textRange
)
Public Function GetListType (
	textRange As TextRange
) As ListType
public:
ListType GetListType(
	TextRange^ textRange
)
member GetListType :
        textRange : TextRange -> ListType
Parameters
textRange TextRange
 The given text range.
Return Value
ListType
 The ListType of the paragraph.
Exceptions
Exception | Condition
ArgumentException |  This text range is empty. -or- This start index of this text range is not within the text range identifying the entire text. -or- The end of this text range is not within the text range identifying the entire text.
ArgumentNullException |  A non-optional argument was null
Remarks
 This function returns the list type of all paragraphs contained in the given range. Returns None if the paragraph is not in a list. Returns Mixed if the list types don't match between the paragraphs.
See Also
Reference
FormattedText Class
Autodesk.Revit.DB Namespace